glcloud/keil_v5/ARM/PACK/.Web/Keil.TMPM0_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>TMPM0_DFP</name>
  <description>Toshiba TX00 Series Device Support</description>

  <releases>
    <release version="1.3.0" date="2017-06-01">
      Device support added for TMPM061 devices.
      Updated documentation.
    </release>
    <release version="1.2.0" date="2016-02-03">
      Device support added for TMPM066, TMPM067, TMPM068 devices.
    </release>
    <release version="1.1.0" date="2015-02-23">
      Device support added for TMPM036, TMPM072, TMPM073, TMPM074 devices.
    </release>
    <release version="1.0.0">
      First Release version of TX00 Series Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Toshiba</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Toshiba</keyword>
    <keyword>TMPM0</keyword>
    <keyword>TX00</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="TX00 Series" Dvendor="Toshiba:92">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents/dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      <description>
The ARM Cortex-M0 core-based TX00 Series supports the Thumb instruction set and delivers high energy efficiency.
Additionally, the TX00 Series incorporates Toshiba’s original high-precision analog functions.
It is ideal for healthcare, energy measurement and portable applications.
      </description>

      <!-- ************************  Subfamily 'M030'  **************************** -->
      <subFamily DsubFamily="M030">

        <!-- *************************  Device 'TMPM036FWFG'  ***************************** -->
        <device Dname="TMPM036FWFG">
          <processor Dclock="20000000"/>
          <compile header="Device/Include/TMPM036.h" define="TMPM036FWFG"/>
          <debug svd="SVD/M036.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM03x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM036FWFG_datasheet_en_20150903.pdf" title="TMPM036FWFG Reference Manual"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="16"/>
          <feature type="DMA"           n="4"                           name="DMA"/>
          <feature type="UART"          n="6"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C"/>
          <feature type="ADC"           n="8"       m="10"              name="AD converter"/>
          <feature type="ExtInt"        n="6"/>
          <feature type="IOs"           n="85"/>
          <feature type="VCC"           n="2.30"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM037FWUG'  ***************************** -->
        <device Dname="TMPM037FWUG">
          <processor Dclock="20000000"/>
          <compile header="Device/Include/TMPM037.h" define="TMPM037FWUG"/>
          <debug svd="SVD/M037.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM03x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM037FWUG_datasheet_en_20141105.pdf" title="TMPM037FWUG Reference Manual"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="DMA"           n="2"                           name="DMA"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C"/>
          <feature type="ADC"           n="8"       m="10"              name="AD converter"/>
          <feature type="ExtInt"        n="6"/>
          <feature type="IOs"           n="52"/>
          <feature type="VCC"           n="2.30"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M060'  **************************** -->
      <subFamily DsubFamily="M060">

        <!-- *************************  Device 'TMPM061FWFG'  ***************************** -->
        <device Dname="TMPM061FWFG">
          <processor Dclock="24000000"/>
          <compile header="Device/Include/TMPM061.h" define="TMPM061FWFG"/>
          <debug svd="SVD/M061.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM06x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM061FWFG_datasheet_en_20151002.pdf" title="TMPM061FWFG Reference Manual"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="9"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="2"       m="10"              name="AD converter"/>
          <feature type="ADC"           n="3"       m="24"              name="DS ADC"/>
          <feature type="ExtInt"        n="4"/>
          <feature type="IOs"           n="64"/>
          <feature type="CoreOther"     n="1"                           name="Temperature sensor (TEMP)"/>
          <feature type="CoreOther"     n="1"                           name="LCD driver/controller (LCDD)"/>
          <feature type="VCC"           n="1.80"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM066FWUG'  ***************************** -->
        <device Dname="TMPM066FWUG">
          <processor Dclock="24000000"/>
          <compile header="Device/Include/TMPM066.h" define="TMPM066FWUG"/>
          <debug svd="SVD/M066.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM06x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM066FWUG_datasheet_en_20160519.pdf" title="TMPM066FWUG Reference Manual"/>

