glcloud/keil_v5/ARM/PACK/.Web/Keil.TMPM0_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="DMA"           n="28"                          name="DMA"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C"/>
          <feature type="SPI"           n="1"                           name="SPI/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"              name="AD converter"/>
          <feature type="ExtInt"        n="6"/>
          <feature type="IOs"           n="48"/>
          <feature type="VCC"           n="1.80"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM067FWQG'  ***************************** -->
        <device Dname="TMPM067FWQG">
          <processor Dclock="24000000"/>
          <compile header="Device/Include/TMPM067.h" define="TMPM067FWQG"/>
          <debug svd="SVD/M067.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM06x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM067FWQG_datasheet_en_20160519.pdf" title="TMPM067FWQG Reference Manual"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="DMA"           n="28"                          name="DMA"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C"/>
          <feature type="SPI"           n="1"                           name="SPI/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"              name="AD converter"/>
          <feature type="ExtInt"        n="6"/>
          <feature type="IOs"           n="48"/>
          <feature type="VCC"           n="1.80"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFN"           n="48"/>
        </device>

        <!-- *************************  Device 'TMPM068FWXBG'  ***************************** -->
        <device Dname="TMPM068FWXBG">
          <processor Dclock="24000000"/>
          <compile header="Device/Include/TMPM068.h" define="TMPM068FWXBG"/>
          <debug svd="SVD/M068.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM06x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM068FWXBG_datasheet_en_20160519.pdf" title="TMPM068FWXBG Reference Manual"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="DMA"           n="28"                          name="DMA"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C"/>
          <feature type="SPI"           n="1"                           name="SPI/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"              name="AD converter"/>
          <feature type="ExtInt"        n="6"/>
          <feature type="IOs"           n="48"/>
          <feature type="VCC"           n="1.80"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="48"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M070'  **************************** -->
      <subFamily DsubFamily="M070">

      <!-- *************************  Device 'TMPM072FSUG'  ***************************** -->
        <device Dname="TMPM072FSUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM072.h" define="TMPM072FSUG"/>
          <debug svd="SVD/M072.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM07x_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <!-- book name="Documents/TMPM072FSUG_datasheet_en_xxx.pdf" title="TMPM072FSUG Reference Manual"/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="DMA"           n="32"                          name="DMA"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C"/>
          <feature type="CoreOther"     n="1"                           name="Vector Engine(VE+)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable motor driver (PMD)"/>
          <feature type="CoreOther"     n="1"                           name="Encoder input circuit (A-ENC)"/>
          <feature type="ADC"           n="11"      m="12"              name="AD converter"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="CoreOther"     n="1"                           name="Input digital noise filter (DNF)"/>
          <feature type="IOs"           n="53"/>
          <feature type="VCC"           n="4.50"    m="5.50"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="64"/>
        </device>

      <!-- *************************  Device 'TMPM073FSDUG'  ***************************** -->
        <device Dname="TMPM073FSDUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM073.h" define="TMPM073FSDUG"/>
          <debug svd="SVD/M073.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM07x_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <!--book name="Documents/TMPM073FSDUG_datasheet_en_xxx.pdf" title="TMPM073FSDUG Reference Manual"/-->

