glcloud/keil_v5/ARM/PACK/.Web/Keil.TMPM0_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="DMA"           n="32"                          name="DMA"/>
          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C"/>
          <feature type="CoreOther"     n="1"                           name="Vector Engine(VE+)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable motor driver (PMD)"/>
          <feature type="CoreOther"     n="1"                           name="Encoder input circuit (A-ENC)"/>
          <feature type="ADC"           n="6"       m="12"              name="AD converter"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="CoreOther"     n="1"                           name="Input digital noise filter (DNF)"/>
          <feature type="IOs"           n="37"/>
          <feature type="VCC"           n="4.50"    m="5.50"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>

      <!-- *************************  Device 'TMPM074FSUG'  ***************************** -->
        <device Dname="TMPM074FSUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM074.h" define="TMPM074FSUG"/>
          <debug svd="SVD/M074.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM07x_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <!--book name="Documents/TMPM074FSUG_datasheet_en_xxx.pdf" title="TMPM074FSUG Reference Manual"/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="DMA"           n="32"                          name="DMA"/>
          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C"/>
          <feature type="CoreOther"     n="1"                           name="Vector Engine(VE+)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable motor driver (PMD)"/>
          <feature type="CoreOther"     n="1"                           name="Encoder input circuit (A-ENC)"/>
          <feature type="ADC"           n="5"       m="12"              name="AD converter"/>
          <feature type="ExtInt"        n="7"/>
          <feature type="CoreOther"     n="1"                           name="Input digital noise filter (DNF)"/>
          <feature type="IOs"           n="33"/>
          <feature type="VCC"           n="4.50"    m="5.50"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="44"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM036 CMSIS">
      <description>Toshiba TMPM036 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM036*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM037 CMSIS">
      <description>Toshiba TMPM037 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM037*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM061 CMSIS">
      <description>Toshiba TMPM061 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM061*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM066 CMSIS">
      <description>Toshiba TMPM066 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM066*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM067 CMSIS">
      <description>Toshiba TMPM067 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM067*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM068 CMSIS">
      <description>Toshiba TMPM068 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM068*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM072 CMSIS">
      <description>Toshiba TMPM072 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM072*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM073 CMSIS">
      <description>Toshiba TMPM073 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM073*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM074 CMSIS">
      <description>Toshiba TMPM074 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM074*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup TMPM036 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM036 CMSIS">
      <description>System Startup for Toshiba TMPM036 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM036.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM036.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM037 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM037 CMSIS">
      <description>System Startup for Toshiba TMPM037 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM037.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM037.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM061 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM061 CMSIS">
      <description>System Startup for Toshiba TMPM061 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM061.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM061.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM066 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM066 CMSIS">
      <description>System Startup for Toshiba TMPM066 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM066.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM066.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM067 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM067 CMSIS">
      <description>System Startup for Toshiba TMPM067 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM067.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM067.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

