glcloud/keil_v5/ARM/PACK/.Web/Keil.TMPM0_DFP.pdsc
    <!-- Startup TMPM068 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM068 CMSIS">
      <description>System Startup for Toshiba TMPM068 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM068.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM068.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM072 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM072 CMSIS">
      <description>System Startup for Toshiba TMPM072 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM072.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM072.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM073 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM073 CMSIS">
      <description>System Startup for Toshiba TMPM073 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM073.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM073.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM074 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM074 CMSIS">
      <description>System Startup for Toshiba TMPM074 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM074.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM074.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

</package>
